Revit 2027 API
BuiltInFailures.EditingFailures.GeneratedByMassing Property
 Selected element(s) produced from Massing shape. Once deleted, the selected element(s) will not be regenerated
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GeneratedByMassing { get; }
Public Shared ReadOnly Property GeneratedByMassing As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GeneratedByMassing {
	FailureDefinitionId^ get ();
}
static member GeneratedByMassing : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace